/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
// Ryabinin (c) 2012
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
#pragma once
#ifndef ATTR_H_
#define ATTR_H_
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/

/// Упакованный тип данных (структура и пр.)
#define ATTR_PACKED					__attribute__((packed))

#ifndef __packed
#define __packed					__attribute__((packed))
#endif // __packed

/// Упакованный тип данных (структура и пр.)
#define ATTR_ALIGNED(x)				__attribute__((aligned(x)))

/// Размещение в оперативной памяти
#define ATTR_RAM					__attribute__((long_call, section (".data")))

#define ATTR_SECTION(x)				__attribute__((section(x)))

/// Функция без пролога и эпилога
#define ATTR_NAKED					__attribute__((naked))

/// Признак функции которая никогда не возвращается
#define ATTR_FUNC_NORETURN			__attribute__((noreturn))

/// Признак функции которая зависит только от входных параметров и глобальных переменных
#define ATTR_FUNC_PURE				__attribute__((pure))

/// Признак объекта который обязательно должна линковаться (хз, не очень то и работает)
#define ATTR_USED					__attribute__((used))

/// Переменная или функция может быть заменена другой с таким же названием
#define ATTR_WEAK					__attribute__((weak))

/// Запретить компилятору инлайнить ф-ю
#define ATTR_NOINLINE				__attribute__((noinline))

/// Размер типа байт
#define ATTR_SIZE_BYTE				__attribute__((mode(byte)))

/// Установить уровень оптимизации для объекта
#define ATTR_OPTIMIZE(level)		__attribute__((optimize((level))))

/// Размещение в заданной секции линкер-скрипта
#define ATTR_SECT(sect)				__attribute__((section((sect))))

/**
 * This attribute, attached to a variable with the static storage, means that the
 *  variable must be emitted even if it appears that the variable is not referenced.
 */
#define ATTR_USED	__attribute__((used))

/**
 * Для задания нескольких атрибутов в одном
 */
#define ATTR(args...)				__attribute__((args))

/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
#endif
/*\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\*/
